tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1847_tdd.h
#define CCP1M3                        522
#define DC1B                          523
#define DC1B0                         524
#define DC1B1                         525
#define P1M                           526
#define P1M0                          527
#define P1M1                          528
#define PWM1CON                       529
#define P1DC                          530
#define P1DC0                         531
#define P1DC1                         532
#define P1DC2                         533
#define P1DC3                         534
#define P1DC4                         535
#define P1DC5                         536
#define P1DC6                         537
#define P1RSEN                        538
#define PSS1BD                        539
#define PSS1BD0                       540
#define PSS1BD1                       541
#define PSS1AC                        542
#define PSS1AC0                       543
#define PSS1AC1                       544
#define CCP1AS                        545
#define CCP1AS0                       546
#define CCP1AS1                       547
#define CCP1AS2                       548
#define CCP1ASE                       549
#define PSTR1CON                      550
#define STR1A                         551
#define STR1B                         552
#define STR1C                         553
#define STR1D                         554
#define STR1SYNC                      555
#define CCPR2L                        556
#define CCPR2H                        557
#define CCP2CON                       558
#define CCP2M                         559
#define CCP2M0                        560
#define CCP2M1                        561
#define CCP2M2                        562
#define CCP2M3                        563
#define DC2B                          564
#define DC2B0                         565
#define DC2B1                         566
#define P2M                           567
#define P2M0                          568
#define P2M1                          569
#define PWM2CON                       570
#define P2DC                          571
#define P2DC0                         572
#define P2DC1                         573
#define P2DC2                         574
#define P2DC3                         575
#define P2DC4                         576
#define P2DC5                         577
#define P2DC6                         578
#define P2RSEN                        579
#define PSS2BD                        580
#define PSS2BD0                       581
#define PSS2BD1                       582
#define PSS2AC0                       583
#define PSS2AC                        584
#define PSS2AC1                       585
#define CCP2AS0                       586
#define CCP2AS                        587
#define CCP2AS1                       588
#define CCP2AS2                       589
#define CCP2ASE                       590
#define PSTR2CON                      591
#define STR2A                         592
#define STR2B                         593
#define STR2C                         594
#define STR2D                         595
#define STR2SYNC                      596
#define CCPTMRS                       597
#define C1TSEL0                       598
#define C1TSEL                        599
#define C1TSEL1                       600
#define C2TSEL0                       601
#define C2TSEL                        602
#define C2TSEL1                       603
#define C3TSEL0                       604
#define C3TSEL                        605
#define C3TSEL1                       606
#define C4TSEL                        607
#define C4TSEL0                       608
#define C4TSEL1                       609
#define CCPR3L                        610
#define CCPR3H                        611
#define CCP3CON                       612
#define CCP3M                         613
#define CCP3M0                        614
#define CCP3M1                        615
#define CCP3M2                        616
#define CCP3M3                        617
#define DC3B                          618
#define DC3B0                         619
#define DC3B1                         620
#define CCPR4L                        621
#define CCPR4H                        622
#define CCP4CON                       623
#define CCP4M                         624
#define CCP4M0                        625
#define CCP4M1                        626
#define CCP4M2                        627
#define CCP4M3                        628
#define DC4B0                         629
#define DC4B                          630
#define DC4B1                         631
#define IOCBP                         632
#define IOCBP0                        633
#define IOCBP1                        634
#define IOCBP2                        635
#define IOCBP3                        636
#define IOCBP4                        637
#define IOCBP5                        638
#define IOCBP6                        639
#define IOCBP7                        640
#define IOCBN0                        641
#define IOCBN                         642
#define IOCBN1                        643
#define IOCBN2                        644
#define IOCBN3                        645
#define IOCBN4                        646
#define IOCBN5                        647
#define IOCBN6                        648
#define IOCBN7                        649
#define IOCBF0                        650
#define IOCBF                         651
#define IOCBF1                        652
#define IOCBF2                        653
#define IOCBF3                        654
#define IOCBF4                        655
#define IOCBF5                        656
#define IOCBF6                        657
#define IOCBF7                        658
#define CLKRCON                       659
#define CLKRDIV                       660
#define CLKRDIV0                      661
#define CLKRDIV1                      662
#define CLKRDIV2                      663
#define CLKRDC                        664
#define CLKRDC0                       665
#define CLKRDC1                       666
#define CLKRSLR                       667
#define CLKROE                        668
#define CLKREN                        669
#define MDCON                         670
#define MDBIT                         671
#define MDOUT                         672
#define MDOPOL                        673
#define MDSLR                         674
#define MDOE                          675
#define MDEN                          676
#define MDSRC                         677
#define MDMS0                         678
#define MDMS                          679
#define MDMS1                         680
#define MDMS2                         681
#define MDMS3                         682
#define MDMSODIS                      683
#define MDCARL                        684
#define MDCL0                         685
#define MDCL                          686
#define MDCL1                         687
#define MDCL2                         688
#define MDCL3                         689
#define MDCLSYNC                      690
#define MDCLPOL                       691
#define MDCLODIS                      692
#define MDCARH                        693
#define MDCH                          694
#define MDCH0                         695
#define MDCH1                         696
#define MDCH2                         697
#define MDCH3                         698
#define MDCHSYNC                      699
#define MDCHPOL                       700
#define MDCHODIS                      701
#define TMR4                          702
#define PR4                           703
#define T4CON                         704
#define T4CKPS0                       705
#define T4CKPS                        706
#define T4CKPS1                       707
#define TMR4ON                        708
#define T4OUTPS                       709
#define T4OUTPS0                      710
#define T4OUTPS1                      711
#define T4OUTPS2                      712
#define T4OUTPS3                      713
#define TMR6                          714
#define PR6                           715
#define T6CON                         716
#define T6CKPS0                       717
#define T6CKPS                        718
#define T6CKPS1                       719
#define TMR6ON                        720
#define T6OUTPS0                      721
#define T6OUTPS                       722
#define T6OUTPS1                      723
#define T6OUTPS2                      724
#define T6OUTPS3                      725
#define STATUS_SHAD                   726
#define C_SHAD                        727
#define DC_SHAD                       728
#define Z_SHAD                        729
#define WREG_SHAD                     730
#define BSR_SHAD                      731
#define PCLATH_SHAD                   732
#define FSR0L_SHAD                    733
#define FSR0H_SHAD                    734
#define FSR1L_SHAD                    735
#define FSR1H_SHAD                    736
#define STKPTR                        737
#define TOSL                          738
#define TOSH                          739

#endif // _PIC16LF1847_H_
